In [3]:
import pandas as pd
import numpy as np

## Melwin you had a doubt in the Pandas and Numpy about the Nan in the data in calcluate the sum,mean,mode in Numpy and Pandas

In [2]:
#getting a file from same directory WPP2019_PopulationByAgeSex_Medium.csv
import numpy as np
pop_data = np.genfromtxt('population2019.csv',usecols =1, delimiter = ',',skip_header = 1)
print("Shape before removing the Nan =>",pop_data.shape)
print(pop_data[np.isnan(pop_data)])
pop_data = pop_data[np.logical_not(np.isnan(pop_data))]  # removing the nan values
# in Numpy without removing the nan we cannot calcluate the operation 
print("Shape After removing the Nan =>",pop_data.shape)
print("SUM                =",pop_data.sum())
print("Mean               = ",np.mean(pop_data))
print("Median             = ",np.median(pop_data))
print("Standard deviation = ",np.std(pop_data))
print("Variance           = ",np.var(pop_data))

# Melwin I think while reading the file using the numpy some values is getting converted to Nan
# Because as you see in the below Pandas Code Shape is not getting Changed in the Pandas even after the dropna

Shape before removing the Nan => (280932,)
[nan nan nan ... nan nan nan]
Shape After removing the Nan => (275175,)
SUM                = 103658546652.572
Mean               =  376700.4511767857
Median             =  14171.316
Standard deviation =  1206931.6752697264
Variance           =  1456684068769.3882

In [3]:
# in Pandas I have not removed the Nan then how is this getting Calcluated ?
df = pd.read_csv('population2019.csv')
print("Shape => ",df.shape)
df = df.dropna()
print("Shape => ",df.shape)
df["PopTotal"].describe()

Shape =>  (280932, 2)
Shape =>  (280932, 2)

count    2.809320e+05
mean     4.128536e+05
std      1.308911e+06
min      1.510000e-01
25%      1.240100e+03
50%      1.420555e+04
75%      1.171661e+05
max      2.163274e+07
Name: PopTotal, dtype: float64

##  Pandas Handel the Nan Better than the Numpy

In [4]:
# Pandas Handel the Nan Better than the Numpy
df = pd.Series({'a':1234567890, 'b':22222234, 'c':np.nan,'d':20,'e':40})
print("Shape before remove =>",df.shape)
print("Sum before remove =>",df.sum())
print("Describe before remove =\n",df.describe())
df = df.dropna()
print("Shapre after remove Nan=>",df.shape)
print("Sum after remove Nan =>",df.sum())
print("Describe before remove =\n",df.describe())
# Melwin Remember the Nan is explictely handeled in the Pandas calcluation is done excluding those rows

Shape before remove => (5,)
Sum before remove => 1256790184.0
Describe before remove =
 count    4.000000e+00
mean     3.141975e+08
std      6.136696e+08
min      2.000000e+01
25%      3.500000e+01
50%      1.111114e+07
75%      3.253086e+08
max      1.234568e+09
dtype: float64
Shapre after remove Nan=> (4,)
Sum after remove Nan => 1256790184.0
Describe before remove =
 count    4.000000e+00
mean     3.141975e+08
std      6.136696e+08
min      2.000000e+01
25%      3.500000e+01
50%      1.111114e+07
75%      3.253086e+08
max      1.234568e+09
dtype: float64

## What will happen tp the pvot if the data set has the duplicate entery in the data set

In [16]:
avo_df = pd.read_csv('datasets/avocado.csv')
avo_df.head()

,Region,Type,Small Bags,Large Bags,Total Bags,Total Volume,AveragePrice,Date
0,Atlanta,organic,89424.11,207.08,89631.19,190257.38,1.70,2018-03-25
1,Atlanta,conventional,102717.50,153.00,102870.50,202790.74,1.75,2018-03-18
2,Boston,organic,120465.39,18.83,120484.22,236822.98,1.58,2018-03-11
3,Boston,conventional,136877.43,60.60,136938.03,239135.67,1.57,2018-03-04
4,California,organic,66273.89,46.58,66320.47,179041.72,1.82,2018-02-25

In [17]:
# adding the duplicate entery
df = pd.DataFrame(avo_df[(avo_df["Region"] == "Atlanta") & (avo_df["Type"] == "organic") ])
avo_df = avo_df.append(df)
# avo_df.reset_index()

In [19]:
avo_df = avo_df.reset_index()

In [26]:
del avo_df['index']

In [27]:
avo_df

,Region,Type,Small Bags,Large Bags,Total Bags,Total Volume,AveragePrice,Date
0,Atlanta,organic,89424.11,207.08,89631.19,190257.38,1.70,2018-03-25
1,Atlanta,conventional,102717.50,153.00,102870.50,202790.74,1.75,2018-03-18
2,Boston,organic,120465.39,18.83,120484.22,236822.98,1.58,2018-03-11
3,Boston,conventional,136877.43,60.60,136938.03,239135.67,1.57,2018-03-04
4,California,organic,66273.89,46.58,66320.47,179041.72,1.82,2018-02-25
5,California,conventional,103033.73,186.20,106984.89,1203274.11,1.01,2018-03-25
6,NewYork,organic,119694.95,92.29,124214.59,777300.99,1.38,2018-03-18
7,NewYork,conventional,193813.92,196.57,197281.89,904333.98,1.29,2018-03-11
8,SanFrancisco,organic,231913.11,1286.43,236417.93,1051308.50,1.16,2018-03-04
9,SanFrancisco,conventional,162913.33,609.20,166836.16,984000.13,1.17,2018-02-25
10,Atlanta,organic,89424.11,207.08,89631.19,190257.38,1.70,2018-03-25

In [28]:
# remember Melwin while creating the pivot the combination of index and colums should not have duplicate entery
# as you see Melwin i have added a extra entery for the  Atlanta in the 10th index which is duplicate
# in the real scenario we have to added up and then we can proceed further
avo_df.pivot(index = 'Region', columns = 'Type')

ValueError: Index contains duplicate entries, cannot reshape

## How to get the Index of the Colum  based on the Condition which we give

### Consider an example to get the index of the max value of the horsepower of the car City wise

In [3]:
vehicle_data = pd.read_csv('datasets/cars_data.csv')
vehicle_data

,car_name,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin_city
0,Chevrolet Chevelle Malibu,18,8,307,130,3504,12.0,70,US
1,Buick Skylark 320,15,8,350,165,3693,11.5,70,US
2,Plymouth Satellite,18,8,318,150,3436,11.0,70,US
3,Citroen DS-21 Pallas,0,4,133,115,3090,17.5,70,Europe
4,Toyota Corolla Mark ii,24,4,113,95,2372,15.0,70,Japan
5,Datsun PL510,27,4,97,88,2130,14.5,70,Japan
6,Volkswagen 1131 Deluxe Sedan,26,4,97,46,1835,20.5,70,Europe
7,Peugeot 504,25,4,110,87,2672,17.5,70,Europe
8,Audi 100 LS,24,4,107,90,2430,14.5,70,Europe
9,Saab 99e,25,4,104,95,2375,17.5,70,Europe
10,BMW 2002,26,4,121,113,2234,12.5,70,Europe
11,Datsun PL510,27,4,97,88,2130,14.5,71,Japan
12,Chevrolet Vega 2300,28,4,140,90,2264,15.5,71,US

### Method 1
Looping through get the values

In [5]:
for x,y in dict(vehicle_data.groupby('origin_city')["horsepower"].max()).items():
    print(vehicle_data[(vehicle_data["origin_city"] == x) & (vehicle_data["horsepower"] == y)].index)

Int64Index([3], dtype='int64')
Int64Index([4], dtype='int64')
Int64Index([1], dtype='int64')

### Method 2
Second method you cannot use all the time as per me

In [8]:
print(vehicle_data.groupby('origin_city')["horsepower"].idxmax())

origin_city
Europe    3
Japan     4
US        1
Name: horsepower, dtype: int64

### Method 3 (Not working)
It would have been bettor if it worked

In [9]:
vehicle_data[(vehicle_data["origin_city"] in dict(vehicle_data.groupby('origin_city')["horsepower"].max()).keys()) &
              (vehicle_data["origin_city"] in dict(vehicle_data.groupby('origin_city')["horsepower"].max()).values())  ]

TypeError: 'Series' objects are mutable, thus they cannot be hashed

In [2]:
### Python Pandas Group by c3 find max of column 2 and get column 1

In [ ]:
list_tuples = [(1990, 'Italy', 'Germaby', 115),
              (1994, 'USA', 'Brazil', 141),
              (1998, 'France', 'France', 171),
              (2002, 'Japan', 'Brazil', 161)]
df_l_t = pd.DataFrame(list_tuples, columns = ['Year', 'Host_country', 'Winner', 'Goals_Scored'])
df_l_t

In [2]:
data = [
[1,'ghk',3,'PTBP',23,'IME','bhmd'],
[2,'ghk',3,'PTBP',23,'IME','bhmd'],
[3,'ghk',3,'PTBP',23,'IME','bhmd'],
[4,'ghk',3,'PTBP',23,'IME-DATA','bhmd'],
[5,'ghk',3,'PTBP',24,'IME-DATA','bhmd'],
[6,'ghk',3,'PTBP',23,'IME','bhmd'],
[7,'ghk',3,'PTBP',23,'IME','bhmd'],
[8,'ghk',3,'PTBP',29,'IME-NA','bhmd'],
[9,'ghk',3,'PTBP',23,'IME','bhmd'],
[10,'ghk',3,'PTBP',23,'IME-NA','bhmd']
]
df = pd.DataFrame(data, columns = ['EMP_ID','NAME','AGE','ADDRESS','SAL','DEPT','LOC'])
df.head()

   EMP_ID NAME  AGE ADDRESS  SAL      DEPT   LOC
0       1  ghk    3    PTBP   23       IME  bhmd
1       2  ghk    3    PTBP   23       IME  bhmd
2       3  ghk    3    PTBP   23       IME  bhmd
3       4  ghk    3    PTBP   23  IME-DATA  bhmd
4       5  ghk    3    PTBP   24  IME-DATA  bhmd

In [3]:
# get the Departement wise Max Salary
df.groupby('DEPT')['SAL'].max()

DEPT
IME         23
IME-DATA    24
IME-NA      29
Name: SAL, dtype: int64

In [4]:
# get the Departement where no of employee is greater than 1
df[df.groupby('DEPT')['SAL'].transform(lambda x : x.count() > 2)].groupby('DEPT')['SAL'].count()

DEPT
IME    6
Name: SAL, dtype: int64

In [5]:
df.groupby('DEPT')['SAL'].apply(lambda x : x.count() >  2)

DEPT
IME          True
IME-DATA    False
IME-NA      False
Name: SAL, dtype: bool

In [6]:
df.apply(lambda x: x.sum() if x.dtype != 'O' else None)

EMP_ID      55.0
NAME         NaN
AGE         30.0
ADDRESS      NaN
SAL        237.0
DEPT         NaN
LOC          NaN
dtype: float64

In [9]:
df.sort_values(by = 'SAL').iloc[1]

EMP_ID        2
NAME        ghk
AGE           3
ADDRESS    PTBP
SAL          23
DEPT        IME
LOC        bhmd
Name: 1, dtype: object

In [8]:
df.sort_values(by = 'SAL')

   EMP_ID NAME  AGE ADDRESS  SAL      DEPT   LOC
0       1  ghk    3    PTBP   23       IME  bhmd
1       2  ghk    3    PTBP   23       IME  bhmd
2       3  ghk    3    PTBP   23       IME  bhmd
3       4  ghk    3    PTBP   23  IME-DATA  bhmd
5       6  ghk    3    PTBP   23       IME  bhmd
6       7  ghk    3    PTBP   23       IME  bhmd
8       9  ghk    3    PTBP   23       IME  bhmd
9      10  ghk    3    PTBP   23    IME-NA  bhmd
4       5  ghk    3    PTBP   24  IME-DATA  bhmd
7       8  ghk    3    PTBP   29    IME-NA  bhmd

### Get the Department wise and the count of the employee having the count more than 1

In [39]:
df = pd.DataFrame({
    'key': ['a','b','b','b','c','c','c','c','c','c','c','c'],
    'A': np.arange(12),
    'B': [1,2,3] * 4,
})

In [40]:
df

   key   A  B
0    a   0  1
1    b   1  2
2    b   2  3
3    b   3  1
4    c   4  2
5    c   5  3
6    c   6  1
7    c   7  2
8    c   8  3
9    c   9  1
10   c  10  2
11   c  11  3

In [42]:
df[df.groupby('key')['B'].transform(lambda x:x.count()>2)]['key'].unique()

array(['b', 'c'], dtype=object)

In [45]:
df[df['key'] == df.groupby('key').size() > 2]

ValueError: Can only compare identically-labeled Series objects

In [ ]:
SELECT Departement, Count(employees) 
FROM Table1
GROUP BY Departement 
having Count(employees) > 2